IDEA StatiCa Open Model
ConcreteBlockData.Center Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Center of the concrete block LCS
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public Point3D Center { get; set; }
Public Property Center As Point3D
	Get
	Set
public:
property Point3D^ Center {
	Point3D^ get ();
	void set (Point3D^ value);
}
Property Value
Type: Point3D
See Also
Reference
ConcreteBlockData Class
IdeaRS.OpenModel.Connection Namespace